Revit 2027 API
ReferenceWithContext.Proximity Property
 The proximity value to the ray's origin when the reference is returned by FindReferencesWithContextByDirection(XYZ, XYZ, View3D) or ReferenceIntersector.Find(XYZ, XYZ).
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Proximity { get; }
Public ReadOnly Property Proximity As Double
	Get
public:
property double Proximity {
	double get ();
}
member Proximity : float with get
Property Value
Double
See Also
Reference
ReferenceWithContext Class
Autodesk.Revit.DB Namespace